// - Дано змінну time яка рівна числу від 0 до 59. 
//Потрібно написати код, який перевірить, до якої четверті години попадає число (в першу, другу, третю или четверту частину години).

/*
    let time = +prompt('введіть цифру від 0 до 59');
    if (time >= 0 && time <= 14)
    {
        alert('перша частина часу')
    }
    else if (time >= 15 && time <= 29)
    {
        alert('друга частина часу')
    }
    else if (time >= 30 && time <= 44)
    {
        alert('третя частина часу')
    }
    else if (time >= 45 && time <= 59)
    {
        alert('четверта частина часу')
    }
    else
    {
        alert('error')
    }
*/

// - У змінній day дано якесь число від 1 до 31. 
//Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

/*
    let day = +prompt('введіть цифру від 1 до 31');
    if (day >= 1 && day <= 10)
    {
        alert('перша декада')
    }
    else if (day >= 11 && day <= 20)
    {
        alert('друга декада')
    }
    else if (day >= 21 && day <= 31)
    {
        alert('третя декада')
    }
    else
    {
        alert('error')
    }
*/


//- У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'. 
//Перевірте роботу скрипта при test, що дорівнює true, false. 
//Напишіть два варіанти скрипта - з коротким записом(тернаркою)

    /* // ДУЖЕ ДОВГИЙ ВАРІАНТ
    let test = prompt('test');
    if (test === 'test')
    {
        alert('Неправильно')
    }
    else
    {
        alert('Вірно')
    }
    */
    /* // УНІВЕРСАЛЬНИЙ ВАРІАНТ
    let test = prompt('password "test"');
    let x = test ==='test' ? 'Неправильно' : 'Вірно';
    alert (x);
    */

        // ТЕ ЩО ПРОСИЛИ ЗРОБИТИ
    /*
    let test = 'test';
    let x = test === 'test' ? 'Неправильно' : 'Вірно';
    console.log(x);
    */
    /*
    let test = 'test';
    let x = test === 'not test' ? 'Неправильно' : 'Вірно';
    console.log(x);
    */

//- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. 
//Перевірте  скрипт при a, що дорівнює 1, 0, -3
/*
    let a = prompt("введіть 0");
    if (a != 0)
    {
        alert('Вірно')
    }
    else
    {
        alert('Невірно')
    }
*/

//- Скласти розклад на тиждень за домопоги switch. 
//Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

/*
    let week = +prompt('Порядковий номер дня тижня "від 1 до 7"');
    switch (week) {
    case 1: 
        alert('Проснутись');
    break;
    case 2:
        alert('Погуляти');
    break;
    case 3: 
        alert('Прочитати книгу');
    break;
    case 4:
        alert('Погодувати котів');
    break;
    case 5: 
        alert('Відвідати Італяю');
    break;
    case 6:
        alert('Покорити еверест');
    break;
    case 7: 
        alert('Завоювати світ');
    break;
    default:
        alert('Порядковий номер дня тижня НЕ ВІРНИЙ');
    break;
}
*/

//- Потрібно визначити Високосний рік чи ні. 
//Високосні роки діляться націло на 4.

/*
    let year = +prompt('який рік');
    if (year % 4 === 0 && year % 100 != 0)
    {
        alert('рік високосний')
    }
    else if (year % 400 === 0)
    {
        alert('рік високосний')
    }
    else
    {
        alert('рік НЕ високосний')
}
*/

//- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

/*
    let js = prompt('Яка «офіційна» назва JavaScript?');
    if (js === 'ECMAScript')
    {
        alert('Правильно!')
    }
    else
    {
        alert('Не знаєте? ECMAScript!')
    }
*/