//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

/*
let z = +prompt('введіть перше число');
let y = +prompt('введіть друге число');

if (z > y)
{
    alert('перше число більше')
}
else if (z < y)
{
    alert('друге число більше')
}
else if (z === y)
{
    alert('числа рівні')
}
else{
    alert('це не цифри')
}
*/

//  - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.


let y = +prompt('введіть номер кваритири від 1 до 90');

if (y >= 1 && y <= 20)
{
    alert('перше падік')
}
else if (y >= 21 && y <= 48)
{
    alert('другий падік')
}
else if (y >= 49 && y <= 90)
{
    alert('третій падік')
}
else{
    alert('не той район')
}



// - Ми маємо змінну number в яку користувач задає числове значення, якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

/*
let number = +prompt('введіть номер');

if (number === 10) {
    alert('ВІРНО')
}
else{
    alert('НЕВІРНО')
}
*/

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
/*
let x = true;

if (typeof x === 'number') {
    console.log(typeof x);
}
else if (typeof x == 'string')
{
    console.log(typeof x);
}
else if (typeof x === 'object')
{
    console.log(typeof x);
}
else if (typeof x === 'boolean')
{
    console.log(typeof x);
}
else{
    alert('НЕВІРНО')
}

*/
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

/*
let school = +prompt('яка температура?');
if(school >= 10 && school <=22)
{
    alert('йдемо ВЧИТИСЯ')
}
else{
    alert('cидимо вдома і вчимося ОНЛАЙН')
}
*/

//  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
// І взалежності від введеного числа нам дається приз.
// (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

/*
let game = +prompt('Вікторина введіть від 1 до 5');
    switch (game) {
    case 1: 
        alert('Авто');
    break;
    case 2:
        alert('Мото');
    break;
    case 3: 
        alert('Телефон');
    break;
    case 4:
        alert('Навушники');
    break;
    case 5: 
        alert('Відпустка в Єгипті');
    break;
    default:
        alert('число не вірне');
    break;
}
*/