// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;
while (i < x.length) {
    console.log(x[i])
    i++;
}
*/

// 2. перебрати його циклом for

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = 0; i < x.length; i++) {
    console.log(x[i]);
};
*/

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
let i = 1;
while (i < x.length) {
    console.log(x[i])
    i += 2;
}
*/

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = 1; i < x.length; i+=2) {
    console.log(x[i]);
};
*/

// 5. перебрати циклом while та вивести  числа тільки парні  значення

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
let i = 0;
while (i < x.length) {
    console.log(x[i])
    i += 2;
}
*/

// 6. перебрати циклом for та вивести  числа тільки парні  значення

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = 0; i < x.length; i+=2) {
    console.log(x[i]);
};
*/

// 7. замінити кожне число кратне 3 на слово "okten"

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = 0; i < x.length; i++){
    if (x[i]%3 ===0){
        x[i] = "okten";
    }
}
console.log(x);
*/

// 8. вивести масив в зворотньому порядку.

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = x.length - 1; i >= 0; i--) {
    console.log(x[i]);
}
*/

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 1.
/*
let x = [2,17,13,6,22,31,45,66,100,-18];
let i = x.length - 1;
while (i >= 0) {
    console.log(x[i])
    i--;
}
*/

// 2. 

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = x.length - 1; i >= 0; i--) {
    console.log(x[i]);
};
*/

// 3. 

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
let i = x.length - 1;
while (i >= 0) {
    console.log(x[i])
    i -= 2;
}
*/

// 4.

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = x.length - 1; i >= 0; i-=2) {
    console.log(x[i]);
};
*/

// 5.

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
let i = x.length - 2;
while (i >= 0) {
    console.log(x[i])
    i -= 2;
}
*/

// 6. 

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = x.length - 2; i >= 0; i-=2) {
    console.log(x[i]);
};
*/

// 7.

/*
let x = [2,17,13,6,22,31,45,66,100,-18];
for (let i = x.length; i > 0; i--){
    if (x[i]%3 ===0){
        x[i] = "okten";
    }
}
console.log(x);
*/
